# **Title: ByteWise Fellowship - ML/DL**

<h1 style="font-family: 'poppins'; font-weight: bold; color: #90EE90;">üë®‚ÄçüíªAuthor: Muhammad Uzair Afridi</h1>

[![GitHub](https://img.shields.io/badge/GitHub-Profile-blue?style=for-the-badge&logo=github)](https://github.com/uzairafridi00) 
[![Kaggle](https://img.shields.io/badge/Kaggle-Profile-blue?style=for-the-badge&logo=kaggle)](https://www.kaggle.com/muhammaduzairafridi) 
[![LinkedIn](https://img.shields.io/badge/LinkedIn-Profile-blue?style=for-the-badge&logo=linkedin)](https://www.linkedin.com/in/uzair-afridi00/)

____

## **Exploring Which NYC schools have the best math results?**

In [1]:
# import libraries
import pandas as pd

In [3]:
# read the data
df = pd.read_csv('schools.csv')
# explore the data
df.head(2)

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9

In [5]:
# Which schools are best for math?
best_maths_school = df[df['average_math'] >= 640][['school_name', 'average_math']].sort_values('average_math', ascending=False)
best_maths_school

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [7]:
# first calculating total_SAT per school
df['total_SAT'] = df['average_math'] + df['average_reading'] + df['average_writing']
df.head(2)

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193

In [9]:
# What are the top 10 performing schools based on the combined SAT scores?

top_1o_schools = df.sort_values('total_SAT', ascending=False)[['school_name', 'total_SAT']]
top_1o_schools.head(5)

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981

In [11]:
# Which NYC borough has the highest standard deviation for total_SAT?
boroughs = df.groupby('borough')['total_SAT'].agg(['count', 'mean', 'std']).round(2)
boroughs

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

In [13]:
# Filter for max std and make borough a column
largest_std_dev = boroughs[boroughs["std"] == boroughs["std"].max()]
largest_std_dev

           count     mean     std
borough
Manhattan     89  1340.13  230.29

In [14]:
# Rename the columns for clarity
largest_std_dev = largest_std_dev.rename(columns={"count": "num_schools", "mean": "average_SAT", "std": "std_SAT"})